In [1]:
import pandas as pd

In [2]:
dat = pd.DataFrame({
    "a": [1]*5 + [2]*5,
    "b": range(10)
})
dat

   a  b
0  1  0
1  1  1
2  1  2
3  1  3
4  1  4
5  2  5
6  2  6
7  2  7
8  2  8
9  2  9

In [5]:
dat.groupby("a").count()

   b
a
1  5
2  5

In [4]:
dat.groupby("a").agg(["sum", "mean", "std"])

    b
  sum mean       std
a
1  10    2  1.581139
2  35    7  1.581139

In [8]:
temp1 = dat.groupby("a").size()
temp1

a
1    5
2    5
dtype: int64

In [9]:
temp1.__class__

pandas.core.series.Series

sizeが返すのは、Series。これをdataframeにする

In [12]:
temp1.to_frame()

   0
a
1  5
2  5

列名が変なのをなおす

In [13]:
temp1.to_frame(name="cnt")

   cnt
a
1    5
2    5

groupbyのキーにしたaが、indexになってしまっているのをなおす

In [14]:
temp1.to_frame(name="cnt").reset_index()

   a  cnt
0  1    5
1  2    5